In [1]:
import pandas as pd
import numpy as np

In [2]:
holiday = pd.read_csv("holidays_events.csv")
oil = pd.read_csv("oil.csv")
store = pd.read_csv("stores.csv")
train_data = pd.read_csv("train.csv")

In [3]:
holiday.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [4]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [5]:
store.tail()

    store_nbr       city       state type  cluster
49         50     Ambato  Tungurahua    A       14
50         51  Guayaquil      Guayas    A       17
51         52      Manta      Manabi    A       11
52         53      Manta      Manabi    D       13
53         54  El Carmen      Manabi    C        3

In [6]:
train_data.tail()

,id,date,store_nbr,family,sales,onpromotion
3000883,3000883,2017-08-15,9,POULTRY,438.133,0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [7]:
len(train_data)

3000888

### Length of all dataframes

In [8]:
vars = [holiday, oil, store, train_data]

for name, lenght in zip(["holiday", "oil", "store", "train_data"], vars):
    print(f"{name}: {len(lenght)}")

holiday: 350
oil: 1218
store: 54
train_data: 3000888

In [9]:
# find out the starting and end date of all df's.
holiday_date = pd.to_datetime(holiday["date"])
oil_date = pd.to_datetime(oil["date"])
train_date = pd.to_datetime(train_data["date"])

In [10]:
holiday_date

0     2012-03-02
1     2012-04-01
2     2012-04-12
3     2012-04-14
4     2012-04-21
         ...
345   2017-12-22
346   2017-12-23
347   2017-12-24
348   2017-12-25
349   2017-12-26
Name: date, Length: 350, dtype: datetime64[ns]

In [11]:
holiday_date.min()

Timestamp('2012-03-02 00:00:00')

In [12]:
holiday_date.max()

Timestamp('2017-12-26 00:00:00')

## Starting and Ending Date

In [13]:
dates = [holiday_date, oil_date, train_date]
for var, date in zip(["holiday_date", "oil_date", "train_date"], dates):
    print(f"{var}: Min-> {date.min()} | Max -> {date.max()}")

holiday_date: Min-> 2012-03-02 00:00:00 | Max -> 2017-12-26 00:00:00
oil_date: Min-> 2013-01-01 00:00:00 | Max -> 2017-08-31 00:00:00
train_date: Min-> 2013-01-01 00:00:00 | Max -> 2017-08-15 00:00:00

In [38]:
# need to rename the type feature in holiday and store.